# Synthesis script for yosys created by qflow
read_liberty -lib -ignore_miss_dir -setattr blackbox /usr/local/share/qflow/tech/osu018/osu018_stdcells.lib
read_verilog  /home/jantsch/developments/Verilog-Projects/AIMS-Book-Examples/Ch05-RTL/Multiplier-Array/Pipelined-n/qflowProject/source/multiplierArray-Pipelined-n-8b.v

# High-level synthesis
synth -top multiplierArray
# Map register flops
dfflibmap -liberty /usr/local/share/qflow/tech/osu018/osu018_stdcells.lib
opt

# Map combinatorial cells, standard script
abc -exe /usr/local/share/qflow/bin/yosys-abc -liberty /usr/local/share/qflow/tech/osu018/osu018_stdcells.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D}
flatten
setundef -zero

clean -purge
# Output buffering
iopadmap -outpad BUFX2 A:Y -bits
# Cleanup
opt
clean
rename -enumerate
write_verilog  multiplierArray_mapped.v
stat
